Tekla Open API Reference for Tekla Structures 2025
ComponentCatalog.SelectedComponentType Property
 Gets or sets the selected component type in the control.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ComponentItem.ComponentTypeEnum SelectedComponentType { get; set; }
Public Property SelectedComponentType As ComponentItem.ComponentTypeEnum
	Get
	Set
Property Value
Type: ComponentItem.ComponentTypeEnum
See Also
Reference
ComponentCatalog Class
Tekla.Structures.Dialog.UIControls Namespace